Конфигурация отчетов/Tasks/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>Задачи</Name>
		</Properties>
	</Task>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/АтрибутыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АтрибутыЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Атрибут</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АтрибутыЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/Enums/АтрибутыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>АтрибутыЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ответственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инициатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьМетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Напоминание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/СтатусВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаИсполнителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Tasks/Задачи/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьПараметрДинамическогоСписка()
    // Имя элемента динамического списка на форме, например, "Список"
	ПодЗадачи.Параметры.УстановитьЗначениеПараметра("Родитель", Объект.Ссылка);

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗадачи()
	
	ДанныеЗадачи = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АтрибутыЗадачиСрезПоследних.Задача КАК Задача,
		|	АтрибутыЗадачиСрезПоследних.Атрибут КАК Атрибут,
		|	АтрибутыЗадачиСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.АтрибутыЗадачи.СрезПоследних(, Задача = &Задача) КАК АтрибутыЗадачиСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеЗадачи.Вставить(Выборка.Атрибут, Выборка.Значение);
	КонецЦикла;
	
	Возврат ДанныеЗадачи;


КонецФункции // ПолучитьДанныеЗадачи()



&НаСервере
Процедура ОбновитьРеквизиты()

	ДанныеЗадачи = ПолучитьДанныеЗадачи();	
	Для Каждого Атрибут Из ДанныеЗадачи Цикл
		Если Атрибут.Ключ = Перечисления.АтрибутыЗадачи.Запланировано Тогда
			Запланировано = Атрибут.Значение;	
		ИначеЕсли Атрибут.Ключ = Перечисления.АтрибутыЗадачи.СтатусВыполнения Тогда
			СтатусЗадачи = Атрибут.Значение;		
		ИначеЕсли Атрибут.Ключ = Перечисления.АтрибутыЗадачи.Ответственный Тогда
			Ответственый = Атрибут.Значение;	
		ИначеЕсли Атрибут.Ключ = Перечисления.АтрибутыЗадачи.Объект Тогда
			ОбъектКлиента = Атрибут.Значение;	
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // ОбновитьРеквизиты()




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрДинамическогоСписка();
	//Обновить элементы
	//ОбновитьРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачу(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Ключ", Элементы.ПодЗадачи.ТекущиеДанные.Задача);
	
	ОткрытьФорму(Элементы.ПодЗадачи.ТекущийЭлемент.Родитель.Родитель.ИмяФормы, Структура);
	ОткрытьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОткрытьНаСервере()
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодЗадачиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МассивЗадач = Новый Массив;
	Соответ = Новый Соответствие;
	МассивРегистра = Строки.ПолучитьКлючи();
	Для Каждого А Из МассивРегистра Цикл
		МассивЗадач.Добавить(А.Задача);	
		Соответ.Вставить(А.Задача, А);
	КонецЦикла;
	//перезапишим масси
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АтрибутыЗадачиСрезПоследних.Задача КАК Задача,
		|	АтрибутыЗадачиСрезПоследних.Атрибут КАК Атрибут,
		|	АтрибутыЗадачиСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.АтрибутыЗадачи.СрезПоследних(, Задача В (&МассивЗадач)) КАК АтрибутыЗадачиСрезПоследних
		|ГДЕ
		|	АтрибутыЗадачиСрезПоследних.Атрибут = &Атрибут";
	
	Запрос.УстановитьПараметр("Атрибут", Перечисления.АтрибутыЗадачи.СтатусВыполнения);
	Запрос.УстановитьПараметр("МассивЗадач", МассивЗадач);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки[Соответ.Получить(Выборка.Задача)];
		СтрокаСписка.Данные["Задача"] = Выборка.Задача; 
		СтрокаСписка.Данные["СтатусВыполнения"] = Выборка.Значение; 
		Если Выборка.Значение = Перечисления.СтатусВыполнения.Завершено Тогда
			СтрокаСписка.Оформление["СтатусВыполнения"].УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЗеленаяЛужайка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПодЗадачиПередНачаломИзменения(Элемент, Отказ)
	Структура = Новый Структура;
	Структура.Вставить("Ключ", Элементы.ПодЗадачи.ТекущиеДанные.Задача);
	
	ОткрытьФорму(Элементы.ПодЗадачи.ТекущийЭлемент.Родитель.Родитель.ИмяФормы, Структура);
	ОткрытьНаСервере();

	Отказ = Истина;
	
КонецПроцедуры

Функция СтруктураПолей()
	
	Структура = Новый Структура;
	Структура.Вставить("СтатусЗадачи", Перечисления.АтрибутыЗадачи.СтатусВыполнения);
	Структура.Вставить("Запланировано", Перечисления.АтрибутыЗадачи.Запланировано);
	Структура.Вставить("ОбъектКлиента", Перечисления.АтрибутыЗадачи.Объект);
	Структура.Вставить("Ответственый", Перечисления.АтрибутыЗадачи.Ответственный);

	Возврат Структура;
	
КонецФункции

Функция СтруктураЭлементов()
	
	Структура = Новый Структура;
	Структура.Вставить("СтатусЗадачи", СтатусЗадачи);
	Структура.Вставить("Запланировано", Запланировано);
	Структура.Вставить("ОбъектКлиента", ОбъектКлиента);
	Структура.Вставить("Ответственый", Ответственый);

	Возврат Структура;
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьРеквизиты();
КонецПроцедуры

&НаСервере
Процедура ЭлементыПриИзминенииНаСервере(ИмяКолонки)

	АтрибутыПолей = СтруктураПолей();
	СтруктураЭлементов = СтруктураЭлементов();
	ТекущийАтрибут = АтрибутыПолей[ИмяКолонки];	
	ТекущееЗначение = СтруктураЭлементов[ИмяКолонки];
	
	АктуальныеЗначения = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Объект.Ссылка, ТекущийАтрибут);
	
	Если АктуальныеЗначения = ТекущееЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущееЗначение) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	НовыеЗаписиВ_Регистры.ЗаписьАтрибута_В_Регистр(Объект.Ссылка, ТекущийАтрибут,
						ТекущееЗначение, ПодготовкаДанных.ПолучитьТекущегоПользователя());
						
	Если ТекущееЗначение = Перечисления.СтатусВыполнения.Завершено Тогда
		Объект.Выполнена = Истина;
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыПриИзминении(Элемент)
	ЭлементыПриИзминенииНаСервере(Элемент.Имя);
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура СоздатьНовуюЗадачу(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Родитель", Объект.Ссылка);

	ОткрытьФорму("Задача.Задачи.ФормаОбъекта");
	Оповестить("НоваяПодЗадача", Объект.Ссылка,);	

КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НоваяПодЗадача" Тогда
		Родитель = Параметр;	
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийРодитель = РегистрыСведений.АтрибутыЗадачи.ТекущийРодительЗадачи(Объект.Ссылка);
	Если ТекущийРодитель <> Родитель Тогда
		НовыеЗаписиВ_Регистры.ЗаписатьРодителя(Объект.Ссылка, Родитель);
		//ЗаписьРодителя_В_Регистр(Объект.Ссылка, Родитель, ПолучениеИнформации_1.ПолучитьТекущегоПользователя());	
	КонецЕсли;
	ЭлементыПриИзминенииНаСервере("СтатусЗадачи");
	ЭлементыПриИзминенииНаСервере("Ответственый");
	ЭлементыПриИзминенииНаСервере("ОбъектКлиента");
	ЭлементыПриИзминенииНаСервере("ОбъектКлиента");

	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Родитель);
	ОповеститьОбИзменении(Объект.Ссылка);

КонецПроцедуры
